Revit 2027 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeError Property
 Cannot create a DirectShape or DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDirectShapeOrTypeError { get; }
Public Shared ReadOnly Property CannotCreateDirectShapeOrTypeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDirectShapeOrTypeError {
	FailureDefinitionId^ get ();
}
static member CannotCreateDirectShapeOrTypeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace